src/cf/Catalogs/ЭлементыОписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ЭлементыОписания</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Описания</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПростогоОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОписаниеСвойствОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОписаниеГруппСвойств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОписанияРеквизитовШапки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственноеОписание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияРеквизитовТабличнойЧасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственноеОписание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияТипов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыФормата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПространствоИмен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияПростыхТипов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыЭлементовОписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовОписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОписаниеОбъектаФормата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заголовок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Типы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ЭлементыОписания/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если Параметры.Свойство("Владелец") И ЗначениеЗаполнено(Параметры.Владелец) Тогда
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли;
	ТекстОписанияПуст = Истина;
	ВерсияФормата = Справочники.ВерсииФормата.НайтиПоНаименованию(СокрЛП(Объект.Владелец.НомерВерсииФормата));
	Если НЕ ЗначениеЗаполнено(ВерсияФормата) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не найдена версия формата, указанная в описании. Редактирование элементов описания невозможно.'"));
		Отказ = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстОписания = Объект.Ссылка.ТекстПростогоОписания.Получить();
		ТекстОписанияПуст = Ложь;
		ИсходнаяПометкаУдаления = Объект.ПометкаУдаления;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ТекстОписания = Параметры.ЗначениеКопирования.ТекстПростогоОписания.Получить();
		ТекстОписанияПуст = Ложь;
	ИначеЕсли Параметры.Свойство("ОбъектФормата") 
		И ЗначениеЗаполнено(Параметры.ОбъектФормата) Тогда
		Если  ТипЗнч(Параметры.ОбъектФормата) = Тип("СправочникСсылка.ОбъектыФормата") Тогда
			Объект.ОбъектФормата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ОбъектФормата, "Наименование");
					Иначе
			Объект.ОбъектФормата = Параметры.ОбъектФормата;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = Параметры.ОбъектФормата;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ТипЭлемента") И ЗначениеЗаполнено(Параметры.ТипЭлемента) Тогда
		Если ТипЗнч(Параметры.ТипЭлемента) = Тип("Строка") Тогда
			Объект.ТипЭлемента = Перечисления.ТипыЭлементовОписания[Параметры.ТипЭлемента];
		Иначе
			Объект.ТипЭлемента = Параметры.ТипЭлемента;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("РежимРаботыМастера") Тогда
		РежимРаботыМастера = Параметры.РежимРаботыМастера;
		
		ЭлементОтбора = ВыборИерархии.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Объект.Владелец;
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Элементы.ВыборИерархии.ТекущаяСтрока = Объект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Если ТекстОписанияПуст И Объект.ТипЭлемента = Перечисления.ТипыЭлементовОписания.Заголовок Тогда
		ТекстОписания = СкопироватьОформлениеЗаголовка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|Наименование
	|ИЗ Справочник.ОбъектыФормата
	|ГДЕ НЕ ПометкаУдаления И Владелец = &ВерсияФормата";
	Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если РежимРаботыМастера Тогда
			Элементы.ОбъектФорматаМ.СписокВыбора.Добавить(Выборка.Наименование);
		Иначе
			Элементы.ОбъектФормата.СписокВыбора.Добавить(Выборка.Наименование);
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(Объект.ОбъектФормата) Тогда
		ТекущийОбъектФормата = ПолучитьСсылкуНаОбъектФормата(Объект.ОбъектФормата, Объект.Владелец);
		ЗаполнитьСвойстваОбъектовФорматаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ТипЭлемента = Перечисления.ТипыЭлементовОписания.ОписаниеОбъектаФормата Тогда
		Если РежимРаботыМастера И ЗначениеЗаполнено(НаименованиеНовогоЗаголовка) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не выбрана группа элементов описания для создания нового заголовка. Операция не выполнена.'"));
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			НовыйЗаголовокОбъект = Справочники.ЭлементыОписания.СоздатьЭлемент();
			НовыйЗаголовокОбъект.УстановитьНовыйКод();
			НовыйЗаголовокОбъект.Владелец = Объект.Владелец;
			НовыйЗаголовокОбъект.Родитель = Объект.Родитель;
			НовыйЗаголовокОбъект.ТипЭлемента = Перечисления.ТипыЭлементовОписания.Заголовок;
			НовыйЗаголовокОбъект.Наименование = Объект.Наименование + " " + НСтр("ru='заголовок'");
			НовыйЗаголовокОбъект.Порядок = ПорядокНовогоЗаголовка;
			НовыйЗаголовокОбъект.УровеньЗаголовка = Объект.Родитель.УровеньЗаголовка + 1;
			ТекстНовогоЗаголовка = СкопироватьОформлениеЗаголовка(НовыйЗаголовокОбъект.УровеньЗаголовка);
			ХТМЛНовогоЗаголовка = "";
			ВложенияЗаголовка = Новый Структура;
			ТекстНовогоЗаголовка.ПолучитьHTML(ХТМЛНовогоЗаголовка, ВложенияЗаголовка);
			ХТМЛНовогоЗаголовка = СтрЗаменить(ХТМЛНовогоЗаголовка, "</body>", НаименованиеНовогоЗаголовка + "</body>");
			ТекстНовогоЗаголовка.УстановитьHTML(ХТМЛНовогоЗаголовка, ВложенияЗаголовка);
			НовыйЗаголовокОбъект.ТекстПростогоОписания = Новый ХранилищеЗначения(ТекстНовогоЗаголовка);
			НовыйЗаголовокОбъект.ОбменДанными.Загрузка = Истина;
			НачатьТранзакцию();
			Попытка
			НовыйЗаголовокОбъект.Записать();
			Исключение
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не удалось создать заголовок для элемента описания. Операция не выполнена.'"));
			Возврат;
			КонецПопытки;
			ЗафиксироватьТранзакцию();
			ТекущийОбъект.Родитель = НовыйЗаголовокОбъект.Ссылка;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущийОбъект.ОбъектФормата) Тогда
			ПеренестиОписанияВТЧОбъекта(ТекущийОбъект);
		КонецЕсли;
	КонецЕсли;
	ХранилищеФорматированногоДокумента = Новый ХранилищеЗначения(ТекстОписания);
	ТекущийОбъект.ТекстПростогоОписания = ХранилищеФорматированногоДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	КПередаче = Новый Структура("ЭлементОписания", ТекущийОбъект.Ссылка);
	Если ЗначениеЗаполнено(ТекущийОбъектФормата) Тогда
		КПередаче.Вставить("ОбъектФормата", ТекущийОбъектФормата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписанЭлементОписания", КПередаче);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Объект.ПометкаУдаления <> ИсходнаяПометкаУдаления Тогда
		КПередаче = Новый Структура("ЭлементОписания", Объект.Ссылка);
		Если ЗначениеЗаполнено(ТекущийОбъектФормата) Тогда
			КПередаче.Вставить("ОбъектФормата", ТекущийОбъектФормата);
		КонецЕсли;
		Оповестить("ЗаписанЭлементОписания", КПередаче);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОбъектФорматаПриИзменении(Элемент)
	ОбъектФорматаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипЭлементаПриИзменении(Элемент)
	ОбновитьВидимостьДоступность();
	Если Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.Заголовок") Тогда
		ТекстОписания = СкопироватьОформлениеЗаголовка();
	Иначе
		Объект.УровеньЗаголовка = 1;
	КонецЕсли;
	Если Объект.ТипЭлемента <> ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата") Тогда
		Объект.ОбъектФормата = "";
		ОбъектФорматаПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	ОписаниеОбъектаФормата = (Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата")); 
	ОписаниеТиповФормата = (Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.Типы"));
	Если РежимРаботыМастера Тогда
		Элементы.ГруппаСтраницыРежимРаботы.ТекущаяСтраница = Элементы.ГруппаРежимРаботыМастера;
		Элементы.ОбъектФорматаМ.Видимость = ОписаниеОбъектаФормата;
		Элементы.УровеньЗаголовкаМ.Видимость = (Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.Заголовок")); 
		Элементы.ОбъектФорматаМ.АвтоОтметкаНезаполненного = ОписаниеОбъектаФормата;
		Элементы.ГруппаСозданиеЗаголовка.Видимость = ОписаниеОбъектаФормата;
		Элементы.ГруппаОписанияСвойствМ.Видимость = ОписаниеОбъектаФормата;
	Иначе
		Элементы.ГруппаСтраницыРежимРаботы.ТекущаяСтраница = Элементы.ГруппаОбычнаяФорма;
		Элементы.ОбъектФормата.Доступность = ОписаниеОбъектаФормата;
		Элементы.УровеньЗаголовка.Доступность = (Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.Заголовок")); 
		Элементы.ОбъектФормата.АвтоОтметкаНезаполненного = ОписаниеОбъектаФормата;
		Элементы.ГруппаОписанияСвойств.Видимость = ОписаниеОбъектаФормата;
		Элементы.ГруппаОписанияТипов.Видимость = ОписаниеТиповФормата;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СкопироватьОформлениеЗаголовка(УровеньЗаголовка = Неопределено)
	Для Каждого СтрокаОбразец Из Объект.Владелец.ОформлениеЗаголовков Цикл
		Если СтрокаОбразец.Уровень = ?(УровеньЗаголовка = Неопределено, Объект.УровеньЗаголовка, УровеньЗаголовка) Тогда
			Возврат СтрокаОбразец.ОбразецОформления.Получить();
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОбъектФорматаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектФормата) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъектФормата = ПолучитьСсылкуНаОбъектФормата(Объект.ОбъектФормата, Объект.Владелец);
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъектФормата) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ОбъектыФормата.Форма.ФормаЭлемента", Новый Структура("Ключ", СсылкаНаОбъектФормата));
КонецПроцедуры

&НаКлиенте
Процедура ВыборИерархииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Объект.Родитель = ВыбраннаяСтрока;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыборИерархииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Если Копирование Тогда
		ПараметрыВвода = Новый Структура("ЗначениеКопирования", Элементы.ВыборИерархии.ТекущаяСтрока);
	Иначе
		ПараметрыВвода = Новый Структура("Владелец, Родитель, ТипЭлемента", Объект.Владелец, Родитель, "Заголовок");
	КонецЕсли;
	ОткрытьФорму("Справочник.ЭлементыОписания.ФормаОбъекта", ПараметрыВвода, ЭтаФорма, Новый УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьСвойстваОбъектовФормата(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектФормата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран объект формата'"));
		Возврат;
	КонецЕсли;
	ДеревоРеквизитовИОписаний.ПолучитьЭлементы().Очистить();
	ЗаполнитьСвойстваОбъектовФорматаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПростыеТипы(Команда)
	МасТипы = Новый Массив;
	МасТипы.Добавить("boolean");
	МасТипы.Добавить("string");
	МасТипы.Добавить("date");  
	МасТипы.Добавить("dateTime");
	МасТипы.Добавить("decimal");
	МасТипы.Добавить("integer");
	МасТипы.Добавить("int");
	МасТипы.Добавить("base64Binary");
	Объект.ОписанияПростыхТипов.Очистить();
	Для Каждого ТекТип Из МасТипы Цикл
		НовТип = Объект.ОписанияПростыхТипов.Добавить();
		НовТип.Наименование = ТекТип;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипыФормата(Команда)
	ЗаполнитьТипыФорматаНаСервере();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийТаблицФормы
&НаКлиенте
Процедура ДеревоРеквизитовИОписанийПриАктивизацииЯчейки(Элемент)
	Если РежимРаботыМастера Тогда 
		ИмяЭлемента = "ДеревоРеквизитовИОписанийМ"; 
	Иначе 
		ИмяЭлемента = "ДеревоРеквизитовИОписаний";
	КонецЕсли;

	Если СтрНайти(Элементы[ИмяЭлемента].ТекущийЭлемент.Имя, "ДеревоРеквизитовИОписанийТекстОписания") > 0 
		И Элементы[ИмяЭлемента].ТекущиеДанные.СобственноеОписание = Ложь Тогда
		
		Если ЗначениеЗаполнено(Элементы[ИмяЭлемента].ТекущиеДанные.ЭлементОписанияХранитель) Тогда
			ПараметрыВр = Новый Структура("Ключ, РежимРаботыМастера", Элементы[ИмяЭлемента].ТекущиеДанные.ЭлементОписанияХранитель, Ложь);
			ОткрытьФорму("Справочник.ЭлементыОписания.Форма.ФормаЭлемента", ПараметрыВр,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ЗначениеЗаполнено(Элементы[ИмяЭлемента].ТекущиеДанные.ОбъектФорматаХранитель) Тогда
			ТекстСообщенияПольз = НСтр("ru='Для объекта формата %1% не найден элемент описания'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрЗаменить(ТекстСообщенияПольз, "%1%", Элементы[ИмяЭлемента].ТекущиеДанные.ОбъектФорматаХранитель));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповИОписанийТипОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	ДанныеОТипах = ТаблицаТиповИОписанийТипОбработкаВыбораНаСервере(ВыбранноеЗначение); 
	Элементы.ОписанияТипов.ТекущиеДанные.БазовыйТип = ДанныеОТипах.БазовыйТип;
	Элементы.ОписанияТипов.ТекущиеДанные.ПространствоИмен = ДанныеОТипах.ПространствоИмен;
	Элементы.ОписанияТипов.ТекущиеДанные.ТекстОписания = ДанныеОТипах.ТекстОписания;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовИОписанийТекстОписанияОткрытие(Элемент, СтандартнаяОбработка)
	Если РежимРаботыМастера Тогда 
		ИмяЭлемента = "ДеревоРеквизитовИОписанийМ";
	Иначе 
		ИмяЭлемента = "ДеревоРеквизитовИОписаний";
	КонецЕсли;

	ОповещениеВводСтроки = Новый ОписаниеОповещения("ЗаконченВводСтроки",ЭтаФорма, Новый Структура("ИмяПоля, ИДСтроки", ИмяЭлемента, Элементы[ИмяЭлемента].ТекущиеДанные.ПолучитьИдентификатор()));
	СтандартнаяОбработка = Ложь;
	ПоказатьВводСтроки(ОповещениеВводСтроки,Элементы[ИмяЭлемента].ТекущиеДанные.ТекстОписания,НСтр("ru='Текст описания'"),250, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТиповИОписанийТекстОписанияОткрытие(Элемент, СтандартнаяОбработка)
	ОповещениеВводСтроки = Новый ОписаниеОповещения("ЗаконченВводСтроки",ЭтаФорма, Новый Структура("ИмяПоля, ИДСтроки", "ОписанияТипов", Элементы.ОписанияТипов.ТекущиеДанные.ПолучитьИдентификатор()));
	СтандартнаяОбработка = Ложь;
	ПоказатьВводСтроки(ОповещениеВводСтроки,Элементы.ОписанияТипов.ТекущиеДанные.ТекстОписания,НСтр("ru='Текст описания'"),250, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОписанияПростыхТиповТекстОписанияОткрытие(Элемент, СтандартнаяОбработка)
	ОповещениеВводСтроки = Новый ОписаниеОповещения("ЗаконченВводСтроки",ЭтаФорма, Новый Структура("ИмяПоля, ИДСтроки", "ОписанияПростыхТипов", Элементы.ОписанияПростыхТипов.ТекущиеДанные.ПолучитьИдентификатор()));
	СтандартнаяОбработка = Ложь;
	ПоказатьВводСтроки(ОповещениеВводСтроки,Элементы.ОписанияТипов.ТекущиеДанные.ТекстОписания,НСтр("ru='Текст описания'"),250, Истина);
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаОбъектФормата(ИмяОбъектФормата, ОписаниеСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|Ссылка
	|ИЗ Справочник.ОбъектыФормата
	|ГДЕ НЕ ПометкаУдаления И Владелец.Наименование = &НаименованиеВерсии
	|	И Наименование = &НаименованиеОбъекта";
	Запрос.УстановитьПараметр("НаименованиеВерсии", СокрЛП(ОписаниеСсылка.НомерВерсииФормата));
	Запрос.УстановитьПараметр("НаименованиеОбъекта", СокрЛП(ИмяОбъектФормата));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ОбъектФорматаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ОбъектФормата) Тогда
		ТекущийОбъектФормата = ПолучитьСсылкуНаОбъектФормата(Объект.ОбъектФормата, Объект.Владелец);
		Объект.ОписанияРеквизитовШапки.Очистить();
		Объект.ОписанияРеквизитовТабличнойЧасти.Очистить();
		ЗаполнитьСвойстваОбъектовФорматаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваОбъектовФорматаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвойстваФормата.Ссылка КАК Ссылка,  
	|	ВЫРАЗИТЬ(СвойстваФормата.Тип КАК Строка(100)) КАК Тип,
	|	СвойстваФормата.Наименование КАК Наименование,
	|	СвойстваФормата.Обязательное КАК Обязательное,
	|	СвойстваФормата.ОбъектХранительСвойств КАК ОбъектХранительСвойств,
	|	СвойстваФормата.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.СвойстваФормата КАК СвойстваФормата
	|ГДЕ
	|	СвойстваФормата.Владелец.Владелец = &ВерсияФормата
	|	И СвойстваФормата.Владелец.Наименование = &ОбъектФормата
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("ОбъектФормата", Объект.ОбъектФормата);
	Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата);  
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Уровень_0 = ДеревоРеквизитовИОписаний.ПолучитьЭлементы();
	ОбработатьВыборкуЗапроса(Выборка, Уровень_0, Ложь);
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборкуЗапроса(Выборка, Уровень, РодительЗакрыт, СсылкаНаРодителя = Неопределено, ВеткаРодитель = Неопределено)
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			РодительЗакрыт = ЗначениеЗаполнено(Выборка.ОбъектХранительСвойств);
			ТекРодитель = ДобавитьСтрокуДереваСвойств(Уровень, Выборка, РодительЗакрыт);
			Если РодительЗакрыт Тогда
				Продолжить;
			КонецЕсли;
			Подвыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, Выборка.Группировка());
			Уровень_1 = ТекРодитель.ПолучитьЭлементы();
			ОбработатьВыборкуЗапроса(Подвыборка, Уровень_1, РодительЗакрыт, Выборка.Ссылка, ТекРодитель)
		Иначе
			Если Выборка.Ссылка = СсылкаНаРодителя Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьСтрокуДереваСвойств(Уровень, Выборка, РодительЗакрыт, ВеткаРодитель)
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуДереваСвойств(УровеньДерева, Выборка, РодительЗакрыт, ВеткаРодитель = Неопределено)
	НовСтрока = УровеньДерева.Добавить();
	НовСтрока.Наименование = Выборка.Наименование;
	НовСтрока.Обязательное = Выборка.Обязательное;
	НовСтрока.ЭтоГруппа = Выборка.ЭтоГруппа;
	НовСтрока.ИндексКартинки = ?(НовСтрока.ЭтоГруппа, 1, 4);
	НовСтрока.СобственноеОписание = Истина;
	НовСтрока.ТипЗначения = Выборка.Тип;
	Если ЗначениеЗаполнено(Выборка.ОбъектХранительСвойств) Или РодительЗакрыт Тогда
		НовСтрока.СобственноеОписание = Ложь;
		Если ЗначениеЗаполнено(Выборка.ОбъектХранительСвойств) Тогда
			НовСтрока.ОбъектФорматаХранитель = Выборка.ОбъектХранительСвойств;
			НовСтрока.ЭлементОписанияХранитель = Справочники.ЭлементыОписания.НайтиПоРеквизиту("ОбъектФормата", СокрЛП(Выборка.ОбъектХранительСвойств),,Объект.Владелец);
		КонецЕсли;
	Иначе
		// Возможно описание есть в ТЧ объекта
		СтрПоиск = Новый Структура("Наименование", НовСтрока.Наименование);
		Если ВеткаРодитель = Неопределено Тогда
			СтрПоиск.Вставить("ЭтоГруппа", НовСтрока.ЭтоГруппа);
			РезультатПоиска = Объект.ОписанияРеквизитовШапки.НайтиСтроки(СтрПоиск);
		Иначе
			СтрПоиск.Вставить("НаименованиеТЧ", ВеткаРодитель.Наименование);
			РезультатПоиска = Объект.ОписанияРеквизитовТабличнойЧасти.НайтиСтроки(СтрПоиск);
		КонецЕсли;
		Если РезультатПоиска.Количество() > 0 Тогда
			НовСтрока.ТекстОписания = РезультатПоиска[0].ТекстОписания;
		КонецЕсли;
	КонецЕсли;
	Возврат НовСтрока;
КонецФункции

&НаСервере
Процедура ПеренестиОписанияВТЧОбъекта(ТекущийОбъект)
	ТекущийОбъект.ОписанияРеквизитовТабличнойЧасти.Очистить();
	ТекущийОбъект.ОписанияРеквизитовШапки.Очистить();
	Уровень_0 = ДеревоРеквизитовИОписаний.ПолучитьЭлементы();
	ОбработатьСтрокиДереваРеквизитов(ТекущийОбъект,Уровень_0,Неопределено);
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокиДереваРеквизитов(ТекущийОбъект,УровеньДерева,ВеткаРодитель)
	Для Каждого СтрокаДерева Из УровеньДерева Цикл
		Если НЕ СтрокаДерева.СобственноеОписание Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаДерева.ТекстОписания) Тогда
			Если ВеткаРодитель = Неопределено Тогда
				НовСтрока = ТекущийОбъект.ОписанияРеквизитовШапки.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаДерева);
			Иначе
				НовСтрока = ТекущийОбъект.ОписанияРеквизитовТабличнойЧасти.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаДерева);
				НовСтрока.НаименованиеТЧ = ВеткаРодитель.Наименование;
			КонецЕсли;
		КонецЕсли;
		ОбработатьСтрокиДереваРеквизитов(ТекущийОбъект,СтрокаДерева.ПолучитьЭлементы(),СтрокаДерева);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыФорматаНаСервере()
	ПространствоИменФормата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВерсияФормата, "ПространствоИмен");
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТипыФормата.Ссылка КАК Тип,
	|	ТипыФормата.БазовыйТип,
	|	ТипыФормата.ПространствоИмен,
	|	ТипыФормата.УдалитьОписание КАК Описание,
	|	ТипыФормата.Наименование КАК Наименование,
	|	ТипыФормата.СоставнойТип,
	|	ОбъектыФормата.Ссылка КАК ОбъектФормата
	|ИЗ Справочник.ТипыФормата КАК ТипыФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|ПО ОбъектыФормата.Владелец = ТипыФормата.Владелец
	|	И ОбъектыФормата.Наименование = ТипыФормата.Наименование
	|	И НЕ ОбъектыФормата.ПометкаУдаления
	|ГДЕ ТипыФормата.Владелец = &ВерсияФормата И ТипыФормата.ПространствоИмен = &ПространствоИмен
	|УПОРЯДОЧИТЬ ПО ТипыФормата.Наименование";
	Объект.ОписанияТипов.Очистить();
	// шаг 1 типы из пространства имен message
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "= &ПространствоИмен", "<> &ПространствоИмен");
	Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата); 
	Запрос.УстановитьПараметр("ПространствоИмен", ПространствоИменФормата);
	Выборка = Запрос.Выполнить().Выбрать();
	ДобавитьСтрокиТиповВТЧ(Выборка);
	// шаг 2 типы из пространства имен формата
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата); 
	Запрос.УстановитьПараметр("ПространствоИмен", ПространствоИменФормата);
	Выборка = Запрос.Выполнить().Выбрать();
	ДобавитьСтрокиТиповВТЧ(Выборка);
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиТиповВТЧ(Выборка)
	ТекстЗапросаСоставныеТипы = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТипФормата КАК Наименование
	|ИЗ Справочник.ТипыФормата.Состав
	|ГДЕ Ссылка = &Тип";
	
	ТекстЗапросаЗначенияПеречисления = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Наименование
	|ИЗ Справочник.ЗначенияФормата
	|ГДЕ Владелец = &ОбъектФормата 
	|	И НЕ ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО Наименование";
	Пока Выборка.Следующий() Цикл
		НовСтрока = Объект.ОписанияТипов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		ОписаниеЗаполнено = Ложь;
		ХранилищеОписания = Выборка.Описание.Получить();
		ТекстСтрокой = "";
		Если ТипЗнч(ХранилищеОписания) = Тип("ФорматированныйДокумент") Тогда
			ТекстСтрокой = ХранилищеОписания.ПолучитьТекст();
			Если ТекстСтрокой <> "" Тогда
				НовСтрока.ТекстОписания = ХранилищеОписания.ПолучитьТекст();
				ОписаниеЗаполнено = Истина;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ОписаниеЗаполнено И ЗначениеЗаполнено(Выборка.ОбъектФормата) Тогда
			ДобавитьВТекстОписанияВозможныеЗначенияТипа(ТекстСтрокой, Выборка.Наименование);
			Если ТекстСтрокой <> "" Тогда
				НовСтрока.ТекстОписания = ТекстСтрокой;
				ОписаниеЗаполнено = Истина;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ОписаниеЗаполнено И Выборка.СоставнойТип Тогда
			ДобавитьВТекстОписанияВозможныйСоставТипа(ТекстСтрокой, Выборка.Тип);
			НовСтрока.ТекстОписания = ТекстСтрокой;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТаблицаТиповИОписанийТипОбработкаВыбораНаСервере(ТипСсылка)
	ДанныеОТипе = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТипСсылка, "Наименование, БазовыйТип, ПространствоИмен, УдалитьОписание, СоставнойТип");
	Результат = Новый Структура("БазовыйТип, ПространствоИмен, ТекстОписания");
	ЗаполнитьЗначенияСвойств(Результат, ДанныеОТипе); 
	ТекстСтрокой = "";
	ХранилищеОписания = ДанныеОТипе.УдалитьОписание.Получить();
	Если ХранилищеОписания <> Неопределено Тогда
		ТекстСтрокой = ХранилищеОписания.ПолучитьТекст();
	КонецЕсли;
	Если ТекстСтрокой <> "" Тогда
		Результат.ТекстОписания = ТекстСтрокой;
		Возврат Результат;
	КонецЕсли;
	ДобавитьВТекстОписанияВозможныеЗначенияТипа(ТекстСтрокой, ДанныеОТипе.Наименование);
	Если ТекстСтрокой <> "" Тогда
		Результат.ТекстОписания = ТекстСтрокой;
		Возврат Результат;
	КонецЕсли;
	Если ДанныеОТипе.СоставнойТип Тогда
		ДобавитьВТекстОписанияВозможныйСоставТипа(ТекстСтрокой, ТипСсылка);
		Результат.ТекстОписания = ТекстСтрокой;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ДобавитьВТекстОписанияВозможныеЗначенияТипа(ТекстСтрокой, ТипНаименование)
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Наименование
	|ИЗ Справочник.ЗначенияФормата
	|ГДЕ Владелец.Владелец = &ВерсияФормата И Владелец.Наименование = &ИмяТипа 
	|	И НЕ ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО Наименование";
	ЗапросЗначения = Новый Запрос;
	ЗапросЗначения.Текст = ТекстЗапроса;
	ЗапросЗначения.УстановитьПараметр("ВерсияФормата", ВерсияФормата);
	ЗапросЗначения.УстановитьПараметр("ИмяТипа", ТипНаименование);
	ЗначенияРезультат = ЗапросЗначения.Выполнить();
	Если НЕ ЗначенияРезультат.Пустой() Тогда
		ТекстСтрокой = НСтр("ru='Возможные значения:'") + Символы.ПС;
		ВыборкаЗначения = ЗначенияРезультат.Выбрать();
		Пока ВыборкаЗначения.Следующий() Цикл
			ТекстСтрокой = ТекстСтрокой + Символы.Таб + СокрЛП(ВыборкаЗначения.Наименование) + Символы.ПС;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьВТекстОписанияВозможныйСоставТипа(ТекстСтрокой, ТипСсылка)
	ТекстЗапросаСоставныеТипы = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТипФормата КАК Наименование
	|ИЗ Справочник.ТипыФормата.Состав
	|ГДЕ Ссылка = &Тип";
	ЗапросСостав = Новый Запрос;
	ЗапросСостав.Текст = ТекстЗапросаСоставныеТипы;
	ЗапросСостав.УстановитьПараметр("Тип", ТипСсылка); 
	Результат = ЗапросСостав.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ТекстСтрокой = НСтр("ru='Состав типа:'") +Символы.ПС;
	ВыборкаСостав = Результат.Выбрать();
	Пока ВыборкаСостав.Следующий() Цикл
		ТекстСтрокой = ТекстСтрокой + СокрЛП(ВыборкаСостав.Наименование) + Символы.ПС;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаконченВводСтроки(ВведеннаяСтрока, ДопПараметры) Экспорт
	Если ВведеннаяСтрока = Неопределено Тогда
		// Нажатие Отмена.
		Возврат;
	КонецЕсли;
	Если ДопПараметры.ИмяПоля = "ДеревоРеквизитовИОписаний" Или ДопПараметры.ИмяПоля = "ДеревоРеквизитовИОписанийМ" Тогда
		ТекСтрока = ДеревоРеквизитовИОписаний.НайтиПоИдентификатору(ДопПараметры.ИДСтроки);
	ИначеЕсли ДопПараметры.ИмяПоля = "ОписанияПростыхТипов" Тогда
		ТекСтрока = Объект.ОписанияПростыхТипов.НайтиПоИдентификатору(ДопПараметры.ИДСтроки);
	Иначе
		ТекСтрока = Объект.ОписанияТипов.НайтиПоИдентификатору(ДопПараметры.ИДСтроки);
	КонецЕсли;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСтрока.ТекстОписания = ВведеннаяСтрока;
КонецПроцедуры


#КонецОбласти
